import pygame

class Settings:

    def __init__(self):
        pygame.init()
        # параметры экрана
        # self.SCREEN_WIDTH, self.SCREEN_HEIGHT = pygame.display.get_desktop_sizes()[0]
        # self.SCREEN_HEIGHT = self.SCREEN_HEIGHT - 200
        self.SCREEN_WIDTH: int = 1000
        self.SCREEN_HEIGHT: int = 1000




        # bg color
        self.COLOR_SKY_BLUE: tuple[int, int, int] = (153, 204, 255)
        self.COLOR_GRASS_GREEN: tuple[int, int, int] = (86, 125, 70)

        self.PLAYER_SPEED: int| float = 1.5

        self.BULLET_COLOR: tuple[int, ...] = (0, 0, 0)
        self.BULLET_WIDTH: int = 20
        self.BULLET_HEIGHT : int  = 8
        self.BULLET_SPEED: int | float = 1.5
        self.BULLET_ALLOWED: int = 3




        # platform, tile
        self.TILE_SIZE: int = 50
        self.LINES_QUANTITY: int = self.SCREEN_WIDTH //self.TILE_SIZE

        #jumping
        # gravity становится отрицательным, поэтому происходит увеличение y_position
        # пример, мяч подброшенный в воздух, с ускорением долетает до максимальной высоты, затем останавливается и
        # стремится вниз (начинает падать вниз с ускорением) из-за сил гравитации
        self.GRAVITATION_FORCE: int = 10


        # walk
        self.walk_cooldown = 20

        self.WORLD_DATA: list[list[int]] = [

            [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 2, 0, 0, 0, 0, 0, 0, 0, 1],
            [1, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 1],
            [1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1],
        ]








